# FinalizeCheck Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IPerformanceAdviserRule..::..FinalizeCheck Method
IPerformanceAdviserRule Interface See Also
---
Invoked by performance advisor once in the end of the check.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
void FinalizeCheck(
	Document document
)
```

Visual Basic
---
```text
Sub FinalizeCheck ( _
	document As Document _
)
```

Visual C++
---
```text
void FinalizeCheck(
	Document^ document
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document Document for which performance problems are being checked.
# See Also
IPerformanceAdviserRule Interface
Autodesk.Revit.DB Namespace